class script(object):
    START_TXT = """<b>ʜᴇʟʟᴏ {} 🫡

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ 😍

ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ ᴜꜱᴇ ᴛʜᴇ ʙᴇʟᴏᴡ ᴏᴘᴛɪᴏɴꜱ 👇</b>"""

    GRP_START_TXT = """<b>ʜᴇʟʟᴏ {} 🫡

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ 😍</b>"""

    HOW_TO_USE_TXT = """<b>
▪️ <u>ᴍᴇᴛʜᴏᴅ 1: ᴅɪʀᴇᴄᴛ ᴍᴇꜱꜱᴀɢᴇ ꜱᴇᴀʀᴄʜ</u>
ꜱᴇɴᴅ ᴛʜᴇ ᴇxᴀᴄᴛ ᴍᴏᴠɪᴇ, ᴡᴇʙ sᴇʀɪᴇs ᴏʀ ᴀɴɪᴍᴇ ɴᴀᴍᴇ ᴅɪʀᴇᴄᴛʟʏ ᴛᴏ ᴍᴇ ʜᴇʀᴇ ɪɴ ᴛʜɪꜱ ᴄʜᴀᴛ.

▪️ <u>ᴍᴇᴛʜᴏᴅ 2: ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ</u>
1. ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɢʀᴏᴜᴘ & ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
2. ᴍᴀᴋᴇ ᴍᴇ ᴀɴ ᴀᴅᴍɪɴ (ᴀʟʟᴏᴡ ᴀʟʟ ʀɪɢʜᴛꜱ ᴇxᴄᴇᴘᴛ ʀᴇᴍᴀɪɴ ᴀɴᴏɴʏᴍᴏᴜꜱ).
3. ꜱᴇɴᴅ ᴛʜᴇ ɴᴀᴍᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ ᴛᴏ ɢᴇᴛ ɪɴꜱᴛᴀɴᴛ ꜰɪʟᴇꜱ.
𝟺. ʏᴏᴜ ᴄᴀɴ ᴀʟꜱᴏ ᴀᴅᴅ ʏᴏᴜʀ ꜰʀɪᴇɴᴅꜱ ᴀɴᴅ ꜰᴀᴍɪʟʏ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ.</b>"""

    RULES_TXT = """<b>📜 <u>ʀᴜʟᴇꜱ</u>
    
1. ꜱᴘᴇʟʟɪɴɢ ᴍᴀᴛᴛᴇʀꜱ: ᴀʟᴡᴀʏꜱ ᴄʜᴇᴄᴋ ᴛʜᴇ ᴇxᴀᴄᴛ ꜱᴘᴇʟʟɪɴɢ ᴏɴ ɢᴏᴏɢʟᴇ ᴏʀ ɪᴍᴅʙ.
✅ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ
✅ ʙʀᴇᴀᴋɪɴɢ ʙᴀᴅ ꜱ𝟶𝟷
❌ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ ᴍᴏᴠɪᴇ
❌ ʙʀᴇᴀᴋɪɴɢ ʙᴀᴅ ꜱᴇᴀꜱᴏɴ 𝟷

2. sᴇᴀʀᴄʜ ғɪʀsᴛ: ᴘʟᴇᴀsᴇ sᴇᴀʀᴄʜ ғᴏʀ ᴛʜᴇ ғɪʟᴇ ɪɴ ᴛʜᴇ ʙᴏᴛ ʙᴇғᴏʀᴇ sᴇɴᴅɪɴɢ ᴀ /request.

3. 15 ᴍɪɴᴜᴛᴇ ʟɪᴍɪᴛ: ꜰɪʟᴇꜱ ᴀʀᴇ ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇᴅ ᴀꜰᴛᴇʀ 15 ᴍɪɴᴜᴛᴇꜱ ꜰᴏʀ ᴄᴏᴘʏʀɪɢʜᴛ ꜱᴀꜰᴇᴛʏ. ꜰᴏʀᴡᴀʀᴅ ᴛʜᴇᴍ ᴛᴏ 'ꜱᴀᴠᴇᴅ ᴍᴇꜱꜱᴀɢᴇꜱ' ᴛᴏ ᴋᴇᴇᴘ ᴛʜᴇᴍ!

4. ɴᴏ ꜱᴘᴀᴍᴍɪɴɢ: ꜱᴇɴᴅɪɴɢ ᴛʜᴇ ꜱᴀᴍᴇ ᴍᴇꜱꜱᴀɢᴇ 5 ᴛɪᴍᴇꜱ ᴡᴏɴ'ᴛ ᴍᴀᴋᴇ ɪᴛ ᴀᴘᴘᴇᴀʀ ꜰᴀꜱᴛᴇʀ. ꜱᴘᴀᴍᴍᴇʀꜱ ᴡɪʟʟ ʙᴇ ᴘᴇʀᴍᴀɴᴇɴᴛʟʏ ʙᴀɴɴᴇᴅ.</b>"""

    COMMANDS_TXT = """<b>🤖 <u>ᴜꜱᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ:</u>

/start - ꜱᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ
/trending - ᴠɪᴇᴡ ᴘᴏᴘᴜʟᴀʀ ᴜᴘʟᴏᴀᴅs
/plan - ᴄʜᴇᴄᴋ ᴘʟᴀɴ ᴅᴇᴛᴀɪʟꜱ
/myplan - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ ꜱᴛᴀᴛꜱ
/request - ʀᴇǫᴜᴇꜱᴛ ᴀ ᴍɪꜱꜱɪɴɢ ᴍᴏᴠɪᴇ
/settings - ᴏᴘᴇɴ ᴛʜᴇ ꜱᴇᴛᴛɪɴɢꜱ ᴍᴇɴᴜ
/connections - ꜱᴇᴇ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘꜱ
/connect - ᴄᴏɴɴᴇᴄᴛ ᴛᴏ ᴘᴍ
/disconnect - ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ꜰʀᴏᴍ ᴘᴍ</b>"""

    REQUEST_TXT = """<b>📝 ʜᴏᴡ ᴛᴏ ʀᴇǫᴜᴇꜱᴛ ᴍᴏᴠɪᴇꜱ, ᴡᴇʙ sᴇʀɪᴇs & ᴀɴɪᴍᴇ

ɪꜰ ʏᴏᴜ ᴄᴀɴ'ᴛ ꜰɪɴᴅ ᴀ ꜰɪʟᴇ, ꜱᴇɴᴅ ᴀ ʀᴇǫᴜᴇꜱᴛ ᴛᴏ ᴏᴜʀ ᴀᴅᴍɪɴꜱ ʀɪɢʜᴛ ʜᴇʀᴇ ɪɴ ᴘᴍ ᴏʀ ᴀɴʏ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘ!

📍 ʜᴏᴡ ᴛᴏ ᴅᴏ ɪᴛ:
ᴛʏᴘᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ, ғᴏʟʟᴏᴡᴇᴅ ɪᴍᴍᴇᴅɪᴀᴛᴇʟʏ ʙʏ ᴛʜᴇ ɴᴀᴍᴇ ᴀɴᴅ ʏᴇᴀʀ/sᴇᴀsᴏɴ:
/request <code>Movie/Web Series/Anime Name</code> & <code>Year/Season</code> 
#request <code>Movie/Web Series/Anime Name</code> & <code>Year/Season</code>

⏳ ᴡʜᴀᴛ ʜᴀᴘᴘᴇɴꜱ ɴᴇxᴛ?
ᴀᴅᴍɪɴꜱ ᴡɪʟʟ ʀᴇᴠɪᴇᴡ ɪᴛ, ᴀɴᴅ ɪ ᴡɪʟʟ ᴘᴇʀꜱᴏɴᴀʟʟʏ ᴍᴇꜱꜱᴀɢᴇ ʏᴏᴜ ʙᴀᴄᴋ ᴏɴᴄᴇ ɪᴛ ɪꜱ ᴜᴘʟᴏᴀᴅᴇᴅ, ᴀʟʀᴇᴀᴅʏ ᴀᴠᴀɪʟᴀʙʟᴇ, ᴏʀ ɴᴏᴛ ꜰᴏᴜɴᴅ.</b>"""

    LOG_TEXT_G = """#NewGroup 1️⃣
ɢʀᴏᴜᴘ = {}(<code>{}</code>)
ᴛᴏᴛᴀʟ ᴍᴇᴍʙᴇʀꜱ = <code>{}</code>
ᴀᴅᴅᴇᴅ ʙʏ = {}"""

    LOG_TEXT_P = """#NewUser 1️⃣
ɪᴅ = <code>{}</code>
ɴᴀᴍᴇ = {}"""

    CAPTION = """<b>{file_name} 

ᴊᴏɪɴ ➠ @TheInsomniacsClub</b>"""

    RESTART_TXT = """
<b>ᴛɪᴄ ᴍᴏᴠɪᴇꜱ ʙᴏᴛ ʜᴀs ʙᴇᴇɴ ʀᴇsᴛᴀʀᴛᴇᴅ 1️⃣

📅 ᴅᴀᴛᴇ: <code>{}</code>
⏰ ᴛɪᴍᴇ: <code>{}</code></b>"""

    LOGO = """
    ▀█▀ █░█ █▀▀ █ █▄░█ █▀ █▀█ █▀▄▀█ █▄░█ █ ▄▀█ █▀▀ █▀ █▀▀ █░░ █░█ █▄▄
    ░█░ █▀█ ██▄ █ █░▀█ ▄█ █▄█ █░▀░█ █░▀█ █ █▀█ █▄▄ ▄█ █▄▄ █▄▄ █▄█ █▄█
    """
