class script(object):
    START_TXT = """<b>ʜᴇʟʟᴏ {} 🫡

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ 😍

ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ ᴜꜱᴇ ᴛʜᴇ ʙᴇʟᴏᴡ ᴏᴘᴛɪᴏɴꜱ 👇</b>"""

    GRP_START_TXT = """<b>ʜᴇʟʟᴏ {} 🫡

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ 😍</b>"""

    HOW_TO_USE_TXT = """<b>
▪️ <u>ᴍᴇᴛʜᴏᴅ 1: ᴅɪʀᴇᴄᴛ ᴍᴇꜱꜱᴀɢᴇ ꜱᴇᴀʀᴄʜ</u>
ꜱᴇɴᴅ ᴛʜᴇ ᴇxᴀᴄᴛ ᴍᴏᴠɪᴇ, ᴡᴇʙ sᴇʀɪᴇs ᴏʀ ᴀɴɪᴍᴇ ɴᴀᴍᴇ ᴅɪʀᴇᴄᴛʟʏ ᴛᴏ ᴍᴇ ʜᴇʀᴇ ɪɴ ᴛʜɪꜱ ᴄʜᴀᴛ.

▪️ <u>ᴍᴇᴛʜᴏᴅ 2: ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ</u>
1. ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɢʀᴏᴜᴘ & ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
2. ᴍᴀᴋᴇ ᴍᴇ ᴀɴ ᴀᴅᴍɪɴ (ᴀʟʟᴏᴡ ᴀʟʟ ʀɪɢʜᴛꜱ ᴇxᴄᴇᴘᴛ ʀᴇᴍᴀɪɴ ᴀɴᴏɴʏᴍᴏᴜꜱ).
3. ꜱᴇɴᴅ ᴛʜᴇ ɴᴀᴍᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ ᴛᴏ ɢᴇᴛ ɪɴꜱᴛᴀɴᴛ ꜰɪʟᴇꜱ.
𝟺. ʏᴏᴜ ᴄᴀɴ ᴀʟꜱᴏ ᴀᴅᴅ ʏᴏᴜʀ ꜰʀɪᴇɴᴅꜱ ᴀɴᴅ ꜰᴀᴍɪʟʏ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ.</b>"""

    RULES_TXT = """<b>📜 <u>ʀᴜʟᴇꜱ</u>
    
1. ᴜꜱᴇ ᴇxᴀᴄᴛ ꜱᴘᴇʟʟɪɴɢꜱ ꜰʀᴏᴍ ɢᴏᴏɢʟᴇ/ɪᴍᴅʙ.
✅ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ | ❌ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ ᴍᴏᴠɪᴇ
✅ ʙʀᴇᴀᴋɪɴɢ ʙᴀᴅ ꜱ𝟶𝟷 | ❌ ʙʀᴇᴀᴋɪɴɢ ʙᴀᴅ ꜱᴇᴀꜱᴏɴ 𝟷

2. ʀᴇᴘʟᴀᴄᴇ ꜱʏᴍʙᴏʟꜱ (- ' : ;) ᴡɪᴛʜ ᴀ ꜱᴘᴀᴄᴇ.
✅ ꜱᴘɪᴅᴇʀ ᴍᴀɴ ɴᴏ ᴡᴀʏ ʜᴏᴍᴇ | ❌ ꜱᴘɪᴅᴇʀ-ᴍᴀɴ: ɴᴏ ᴡᴀʏ ʜᴏᴍᴇ

3. ꜰᴏʀ ʟᴏɴɢ ɴᴀᴍᴇꜱ, ꜱᴇᴀʀᴄʜ ᴜꜱɪɴɢ ᴊᴜꜱᴛ 1 ᴏʀ 2 ᴍᴀɪɴ ᴡᴏʀᴅꜱ.
✅ ᴡᴀʏ ʜᴏᴍᴇ | ✅ ᴇɴᴅɢᴀᴍᴇ

4. ꜰɪʟᴇꜱ ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇ ɪɴ 15 ᴍɪɴꜱ (ᴄᴏᴘʏʀɪɢʜᴛ ꜱᴀꜰᴇᴛʏ). ꜰᴏʀᴡᴀʀᴅ ᴛᴏ 'ꜱᴀᴠᴇᴅ ᴍᴇꜱꜱᴀɢᴇꜱ' ᴛᴏ ᴋᴇᴇᴘ ᴛʜᴇᴍ!

5. ɴᴏ ꜱᴘᴀᴍᴍɪɴɢ! ʀᴇᴘᴇᴀᴛᴇᴅ ʀᴇǫᴜᴇꜱᴛꜱ ᴡɪʟʟ ʀᴇꜱᴜʟᴛ ɪɴ ᴀ ᴘᴇʀᴍᴀɴᴇɴᴛ ʙᴀɴ.</b>"""

    COMMANDS_TXT = """<b>🤖 <u>ᴜꜱᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ:</u>

/start - ꜱᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ
/trending - ᴠɪᴇᴡ ᴘᴏᴘᴜʟᴀʀ ᴜᴘʟᴏᴀᴅs
/plan - ᴄʜᴇᴄᴋ ᴘʟᴀɴ ᴅᴇᴛᴀɪʟꜱ
/myplan - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ ꜱᴛᴀᴛꜱ
/request - ʀᴇǫᴜᴇꜱᴛ ᴀ ᴍɪꜱꜱɪɴɢ ᴍᴏᴠɪᴇ
/settings - ᴏᴘᴇɴ ᴛʜᴇ ꜱᴇᴛᴛɪɴɢꜱ ᴍᴇɴᴜ
/connections - ꜱᴇᴇ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘꜱ
/connect - ᴄᴏɴɴᴇᴄᴛ ᴛᴏ ᴘᴍ
/disconnect - ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ꜰʀᴏᴍ ᴘᴍ</b>"""

    REQUEST_TXT = """<b>📝 ʜᴏᴡ ᴛᴏ ʀᴇǫᴜᴇꜱᴛ ᴍᴏᴠɪᴇꜱ, ᴡᴇʙ ꜱᴇʀɪᴇꜱ & ᴀɴɪᴍᴇ

ɪꜰ ʏᴏᴜ ᴄᴀɴ'ᴛ ꜰɪɴᴅ ᴀ ꜰɪʟᴇ, ʀᴇǫᴜᴇꜱᴛ ɪᴛ ʜᴇʀᴇ ɪɴ ᴘᴍ ᴏʀ ᴀɴʏ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘ!

📍 ʜᴏᴡ ᴛᴏ ᴅᴏ ɪᴛ:
ᴛʏᴘᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜ ᴛʜᴇ ɴᴀᴍᴇ ᴀɴᴅ ʏᴇᴀʀ/ꜱᴇᴀꜱᴏɴ:
/request <code>Movie/Web Series/Anime Name</code> & <code>Year/Season</code>
#request <code>Movie/Web Series/Anime Name</code> & <code>Year/Season</code>

⛔️ ᴅᴏ ɴᴏᴛ ʀᴇǫᴜᴇꜱᴛ:
• ᴜɴʀᴇʟᴇᴀꜱᴇᴅ ᴍᴏᴠɪᴇꜱ
• ᴏɴɢᴏɪɴɢ ᴡᴇʙ ꜱᴇʀɪᴇꜱ ᴏʀ ᴀɴɪᴍᴇ
⚠️ ᴛʜᴇꜱᴇ ᴡɪʟʟ ʙᴇ ɪɢɴᴏʀᴇᴅ ᴡɪᴛʜᴏᴜᴛ ᴀ ʀᴇᴘʟʏ.

⏳ ᴡʜᴀᴛ ʜᴀᴘᴘᴇɴꜱ ɴᴇxᴛ?
ᴀᴅᴍɪɴꜱ ᴡɪʟʟ ʀᴇᴠɪᴇᴡ, ᴀɴᴅ ɪ ᴡɪʟʟ ᴍᴇꜱꜱᴀɢᴇ ʏᴏᴜ ᴏɴᴄᴇ ɪᴛ ɪꜱ ᴜᴘʟᴏᴀᴅᴇᴅ, ᴀᴠᴀɪʟᴀʙʟᴇ, ᴏʀ ɴᴏᴛ ꜰᴏᴜɴᴅ.</b>"""

    LOG_TEXT_G = """#NewGroup 1️⃣
ɢʀᴏᴜᴘ = {}(<code>{}</code>)
ᴛᴏᴛᴀʟ ᴍᴇᴍʙᴇʀꜱ = <code>{}</code>
ᴀᴅᴅᴇᴅ ʙʏ = {}"""

    LOG_TEXT_P = """#NewUser 1️⃣
ɪᴅ = <code>{}</code>
ɴᴀᴍᴇ = {}"""

    CAPTION = """<b>{file_name} 

ᴊᴏɪɴ ➠ @TheInsomniacsClub</b>"""

    RESTART_TXT = """
<b>ᴛɪᴄ ᴍᴏᴠɪᴇꜱ ʙᴏᴛ ʜᴀs ʙᴇᴇɴ ʀᴇsᴛᴀʀᴛᴇᴅ 1️⃣

📅 ᴅᴀᴛᴇ: <code>{}</code>
⏰ ᴛɪᴍᴇ: <code>{}</code></b>"""

    LOGO = """
    ▀█▀ █░█ █▀▀ █ █▄░█ █▀ █▀█ █▀▄▀█ █▄░█ █ ▄▀█ █▀▀ █▀ █▀▀ █░░ █░█ █▄▄
    ░█░ █▀█ ██▄ █ █░▀█ ▄█ █▄█ █░▀░█ █░▀█ █ █▀█ █▄▄ ▄█ █▄▄ █▄▄ █▄█ █▄█
    """
