class script(object):
    START_TXT = """<b>🫡 ʜᴇʟʟᴏ {}

🎬 ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ

👇 ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ ᴜꜱᴇ ᴛʜᴇ ʙᴇʟᴏᴡ ᴏᴘᴛɪᴏɴꜱ</b>"""

    GRP_START_TXT = """<b>🫡 ʜᴇʟʟᴏ {}

🎬 ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ</b>"""

    HOW_TO_USE_TXT = """<b>
▪️ <u>ᴍᴇᴛʜᴏᴅ 1: ᴅɪʀᴇᴄᴛ ᴍᴇꜱꜱᴀɢᴇ ꜱᴇᴀʀᴄʜ</u>
ꜱᴇɴᴅ ᴛʜᴇ ᴇxᴀᴄᴛ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ ᴅɪʀᴇᴄᴛʟʏ ᴛᴏ ᴍᴇ ʜᴇʀᴇ ɪɴ ᴛʜɪꜱ ᴄʜᴀᴛ.

▪️ <u>ᴍᴇᴛʜᴏᴅ 2: ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ</u>
1. ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɢʀᴏᴜᴘ & ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
2. ᴍᴀᴋᴇ ᴍᴇ ᴀɴ ᴀᴅᴍɪɴ ᴡɪᴛʜ 'ᴅᴇʟᴇᴛᴇ ᴍᴇꜱꜱᴀɢᴇꜱ' ʀɪɢʜᴛꜱ.
3. ꜱᴇɴᴅ ᴀɴʏ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ ᴛᴏ ɢᴇᴛ ɪɴꜱᴛᴀɴᴛ ꜰɪʟᴇꜱ!
4. ʏᴏᴜ ᴄᴀɴ ᴀʟꜱᴏ ᴀᴅᴅ ʏᴏᴜʀ ꜰʀɪᴇɴᴅꜱ ᴀɴᴅ ꜰᴀᴍɪʟʏ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ.</b>"""

    RULES_TXT = """<b>📜 <u>ʜᴏᴡ ᴛᴏ ꜱᴇᴀʀᴄʜ ᴍᴏᴠɪᴇꜱ</u>
    
1. ᴜꜱᴇ ᴇxᴀᴄᴛ ꜱᴘᴇʟʟɪɴɢ ꜰʀᴏᴍ ɢᴏᴏɢʟᴇ / ɪᴍᴅʙ.
✅ <code>ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ</code>
❌ <code>ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ ᴍᴏᴠɪᴇ</code> (ᴅᴏɴ'ᴛ ᴀᴅᴅ 'ᴍᴏᴠɪᴇ')

2. ꜱʏᴍʙᴏʟꜱ & ᴀᴄʀᴏɴʏᴍꜱ ᴡᴏʀᴋ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ!
✅ <code>ꜱᴘɪᴅᴇʀ-ᴍᴀɴ: ɴᴏ ᴡᴀʏ ʜᴏᴍᴇ</code>
✅ <code>ꜰᴀꜱᴛ & ꜰᴜʀɪᴏᴜꜱ</code> ᴏʀ <code>ꜰᴀꜱᴛ ᴀɴᴅ ꜰᴜʀɪᴏᴜꜱ</code>
✅ <code>ᴋ.ɢ.ꜰ</code> ᴏʀ <code>ᴋɢꜰ</code>

3. ꜰᴏʀ ꜱʜᴏʀᴛ ᴛɪᴛʟᴇꜱ (1-2 ʟᴇᴛᴛᴇʀꜱ), ᴀʟᴡᴀʏꜱ ᴀᴅᴅ ᴛʜᴇ ʏᴇᴀʀ:
✅ <code>ɪ 2015</code> | ✅ <code>96 2018</code>

4. ꜰɪʟᴇꜱ ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇ ɪɴ 15 ᴍɪɴꜱ (ᴄᴏᴘʏʀɪɢʜᴛ ꜱᴀꜰᴇᴛʏ). ꜰᴏʀᴡᴀʀᴅ ᴛᴏ 'ꜱᴀᴠᴇᴅ ᴍᴇꜱꜱᴀɢᴇꜱ' ᴛᴏ ᴋᴇᴇᴘ ᴛʜᴇᴍ!

5. ɴᴏ ꜱᴘᴀᴍᴍɪɴɢ! ʀᴇᴘᴇᴀᴛᴇᴅ ꜱᴘᴀᴍ ᴡɪʟʟ ʀᴇꜱᴜʟᴛ ɪɴ ᴀɴ ᴀᴜᴛᴏᴍᴀᴛɪᴄ ʙᴀɴ.</b>"""

    COMMANDS_TXT = """<b>🤖 <u>ᴜꜱᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ:</u>

/start - ꜱᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ
/id - ɢᴇᴛ ᴛᴇʟᴇɢʀᴀᴍ ɪᴅ
/recent - sᴇɴᴅ ᴀ ʟɪsᴛ ᴏғ ʀᴇᴄᴇɴᴛ ᴜᴘʟᴏᴀᴅs <u>[ꜱᴜʙꜱᴄʀɪʙᴇᴅ ᴜsᴇʀs]</u>
/plan - ᴄʜᴇᴄᴋ ᴘʟᴀɴ ᴅᴇᴛᴀɪʟꜱ
/myplan - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ ꜱᴛᴀᴛꜱ
/request - ʀᴇǫᴜᴇꜱᴛ ᴀ ᴍɪꜱꜱɪɴɢ ғɪʟᴇ
/settings - ᴏᴘᴇɴ ᴛʜᴇ ꜱᴇᴛᴛɪɴɢꜱ ᴍᴇɴᴜ</b>"""

    REQUEST_TXT = """<b>📝 ʜᴏᴡ ᴛᴏ ʀᴇǫᴜᴇꜱᴛ ᴍᴏᴠɪᴇꜱ

ᴄᴀɴ'ᴛ ꜰɪɴᴅ ᴀ ꜰɪʟᴇ? ʀᴇǫᴜᴇꜱᴛ ɪᴛ ʜᴇʀᴇ ɪɴ ʙᴏᴛ ᴘᴍ!

📍 ʜᴏᴡ ᴛᴏ ᴅᴏ ɪᴛ:
ᴛʏᴘᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜ ᴛʜᴇ ɴᴀᴍᴇ ᴀɴᴅ ʏᴇᴀʀ: <code>/request Movie Name & Year</code>

⛔️ ᴅᴏ ɴᴏᴛ ʀᴇǫᴜᴇꜱᴛ ᴜɴʀᴇʟᴇᴀꜱᴇᴅ ᴍᴏᴠɪᴇꜱ [ᴡɪʟʟ ʙᴇ ɪɢɴᴏʀᴇᴅ ᴡɪᴛʜᴏᴜᴛ ᴀ ʀᴇᴘʟʏ]

⏳ ᴡʜᴀᴛ ʜᴀᴘᴘᴇɴꜱ ɴᴇxᴛ?
ᴀᴅᴍɪɴꜱ ᴡɪʟʟ ʀᴇᴠɪᴇᴡ, ᴀɴᴅ ɪ ᴡɪʟʟ ᴍᴇꜱꜱᴀɢᴇ ʏᴏᴜ ᴏɴᴄᴇ ɪᴛ ɪꜱ ᴜᴘʟᴏᴀᴅᴇᴅ, ᴀʟʀᴇᴀᴅʏ ᴀᴠᴀɪʟᴀʙʟᴇ, ᴏʀ ɴᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ.</b>"""

    LOG_TEXT_G = """<b>#ɴᴇᴡɢʀᴏᴜᴘ 1️⃣\nɢʀᴏᴜᴘ = {}(<code>{}</code>)\nᴛᴏᴛᴀʟ ᴍᴇᴍʙᴇʀꜱ = <code>{}</code>\nᴀᴅᴅᴇᴅ ʙʏ = {}</b>"""

    LOG_TEXT_P = """<b>#ɴᴇᴡᴜꜱᴇʀ 1️⃣\nɪᴅ = <code>{}</code>\nɴᴀᴍᴇ = {}</b>"""

    CAPTION = """<b>📂 {file_name} 

ᴊᴏɪɴ ➠ @TheInsomniacsClub</b>"""

    RESTART_TXT = """
<b>ᴛɪᴄ ᴍᴏᴠɪᴇꜱ ʙᴏᴛ ʜᴀꜱ ʙᴇᴇɴ ʀᴇꜱᴛᴀʀᴛᴇᴅ 1️⃣

📅 ᴅᴀᴛᴇ: <code>{}</code>
⏰ ᴛɪᴍᴇ: <code>{}</code></b>"""

    LOGO = """
    ▀█▀ █░█ █▀▀ █ █▄░█ █▀ █▀█ █▀▄▀█ █▄░█ █ ▄▀█ █▀▀ █▀ █▀▀ █░░ █░█ █▄▄
    ░█░ █▀█ ██▄ █ █░▀█ ▄█ █▄█ █░▀░█ █░▀█ █ █▀█ █▄▄ ▄█ █▄▄ █▄▄ █▄█ █▄█
    """
